# Stairs Type Middle Support Type Property

Source: https://www.revitapidocs.com/2026/be91b3a0-047b-bf7f-27e4-3a22c1930735.htm

---

| Stairs Type Middle Support Type Property |
| --- |

The type of middle supports used in the stair.
**Namespace:** Autodesk.Revit.DB.Architecture
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId MiddleSupportType { get; set; }
```

```
Public Property MiddleSupportType As ElementId
	Get
	Set
```

```
public:
property ElementId^ MiddleSupportType {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member MiddleSupportType : ElementId with get, set
```

#### Property Value

ElementId
invalidElementId if the stairs type has no middle support. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: supportType is not a valid support type. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |
| InvalidOperationException | When setting this property: The stairs type has no middle support so the data being set is not applicable. |

See Also

#### Reference

StairsType Class Autodesk.Revit.DB.Architecture Namespace